DoAnPizza/app/Http/Services/Menu/MenuService.php

    public function getParent(){
        return Menu:: where('parent_id',0)->get();
---
select * from `menus` where `parent_id` = 0